In [ ]:
#Q1.) Python has 5 standard data types. Numeric, Sequence Type, Boolean, Set, and Dictionary. 
#Numeric data represents integers(positive or negative whole numbers), Float(real number in standard form), and Complex numbers that include a real and imaginary part.
#Sequence type includes Strings(1+ characters within 1-3 quotation marks), Lists(Ordered collection of data), and Tuples(similar to Lists but cannot be changed after creation)
#Boolean type means it corresponds to either a true or false built in value.
#Set type is an unordered collection that contains no duplicate values, can have values entered after creation, and is capable of returning its values one at a time(like a list)
#Dictionary is another unordered collection of data but contains a unique identifier key and a value that can be identified using that key.

In [69]:
import pandas as pd

In [70]:
emp = {'Name':['Nancy','Andrew','Janet','Margaret','Steven'],
      'monthly_salary':[5000,4000,6000,3000,2000],
       'zip':[98122,98401,98033,98052,98051] }
emp

{'Name': ['Nancy', 'Andrew', 'Janet', 'Margaret', 'Steven'],
 'monthly_salary': [5000, 4000, 6000, 3000, 2000],
 'zip': [98122, 98401, 98033, 98052, 98051]}

In [71]:
df = pd.DataFrame(emp)
df

       Name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [72]:
print(df.iloc[0:])

       Name  monthly_salary    zip
0     Nancy            5000  98122
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
4    Steven            2000  98051

In [73]:
print(df.iloc[0,:])

Name              Nancy
monthly_salary     5000
zip               98122
Name: 0, dtype: object

In [74]:
print(df.iloc[4,:])

Name              Steven
monthly_salary      2000
zip                98051
Name: 4, dtype: object

In [75]:
print('Shape of Dataframe',df.shape)

Shape of Dataframe (5, 3)

In [80]:
mean_df = df['monthly_salary'].mean()

In [81]:
print(mean_df)

4000.0

In [82]:
df.sort_values(by="Name",
              ascending=True)

       Name  monthly_salary    zip
1    Andrew            4000  98401
2     Janet            6000  98033
3  Margaret            3000  98052
0     Nancy            5000  98122
4    Steven            2000  98051

In [83]:
print(df.iloc[2])

Name              Janet
monthly_salary     6000
zip               98033
Name: 2, dtype: object

In [84]:
df['annual_salary'] = df.apply(lambda row: row.monthly_salary + (row.monthly_salary * 11), axis=1)
df

       Name  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [85]:
df = df.rename(columns={'Name': 'firstname'})
df

  firstname  monthly_salary    zip  annual_salary
0     Nancy            5000  98122          60000
1    Andrew            4000  98401          48000
2     Janet            6000  98033          72000
3  Margaret            3000  98052          36000
4    Steven            2000  98051          24000

In [88]:
emp_info=df.drop('monthly_salary', axis=1)
emp_info

  firstname    zip  annual_salary
0     Nancy  98122          60000
1    Andrew  98401          48000
2     Janet  98033          72000
3  Margaret  98052          36000
4    Steven  98051          24000

In [89]:
df1=df['firstname']
df1

0       Nancy
1      Andrew
2       Janet
3    Margaret
4      Steven
Name: firstname, dtype: object

In [90]:
df2=emp_info.drop('annual_salary',axis=1)
df2

  firstname    zip
0     Nancy  98122
1    Andrew  98401
2     Janet  98033
3  Margaret  98052
4    Steven  98051